kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
#include "gui/imgui_window.h"
#include "gui/blueprint_editor.h"
#include "editor/text_editor.h"
#include "editor/syntax_highlighter.h"
#include "file_manager/file_manager.h"
#include "compiler/esp32_compiler.h"
#include "serial/serial_monitor.h"
#include "ai_assistant/ai_assistant.h"

#include "imgui.h"
#include "imgui_impl_glfw.h"
#include "imgui_impl_opengl3.h"

#include <GLFW/glfw3.h>
#include <iostream>
#include <cstdio>
#include <algorithm>

namespace esp32_ide {
namespace gui {

// Constants
static constexpr size_t EDITOR_BUFFER_SIZE = 1024 * 1024; // 1MB buffer for text editor

// UI Panel widths
static constexpr float LEFT_PANEL_WIDTH = 250.0f;
static constexpr float RIGHT_PANEL_WIDTH = 250.0f;
static constexpr float AI_PANEL_WIDTH = 300.0f;
static const char* DEFAULT_SKETCH_TEMPLATE = 
    "void setup() {\n"
    "  // put your setup code here, to run once:\n"
    "\n"
    "}\n"
    "\n"
    "void loop() {\n"
    "  // put your main code here, to run repeatedly:\n"
    "\n"
    "}\n";

static const char* SIMPLE_SKETCH_TEMPLATE = 
    "void setup() {\n"
    "\n"
    "}\n"
    "\n"
    "void loop() {\n"
    "\n"
    "}\n";

// Sample disassembly data for ESP32 (Xtensa LX6 instructions)
static const std::vector<std::string> SAMPLE_DISASSEMBLY_DATA = {
    "0x40080000: entry a1, 64",
    "0x40080003: s32i.n a0, a1, 0",
    "0x40080005: call0 app_main",
    "0x40080008: retw.n",
    "0x4008000a: l32r a2, 0x40080100",
    "0x4008000d: l32i a3, a2, 0",
    "0x40080010: addi a3, a3, 1",
    "0x40080013: s32i a3, a2, 0",
    "0x40080016: movi a2, 0x100",
    "0x40080019: call0 vTaskDelay"
};

// Sample RE analysis result constants
static constexpr const char* SAMPLE_RE_ARCHITECTURE = "Xtensa LX6";
static constexpr const char* SAMPLE_RE_FLASH_SIZE = "4MB";
static constexpr const char* SAMPLE_RE_ENTRY_POINT = "0x40080000";
static constexpr int SAMPLE_RE_FUNCTIONS_DETECTED = 42;
static constexpr int SAMPLE_RE_STRINGS_FOUND = 127;

static void glfw_error_callback(int error, const char* description) {
    std::cerr << "GLFW Error " << error << ": " << description << std::endl;
}

ImGuiWindow::ImGuiWindow()
    : window_(nullptr),
      text_editor_(nullptr),
      file_manager_(nullptr),
      compiler_(nullptr),
      serial_monitor_(nullptr),
      syntax_highlighter_(nullptr),
      show_file_explorer_(false),
      show_properties_panel_(true),
      show_ai_assistant_(true),
      current_center_tab_(0),
      active_editor_tab_(0),
      selected_port_index_(0),
      selected_baud_rate_(115200),
      is_connected_(false),
      connection_attempted_(false),
      scroll_to_bottom_(false),
      selected_file_index_(-1),
      cached_line_count_(0),
      line_count_dirty_(true),
      ai_scroll_to_bottom_(false),
      re_analysis_performed_(false),
      re_disassembly_performed_(false),
      terminal_scroll_to_bottom_(false),
      show_terminal_(true),
      selected_board_index_(-1),
      show_board_list_(true),
      show_device_schematic_(false),
      current_schematic_view_(0),
      enable_syntax_highlighting_(true),
      show_line_numbers_(true),
      auto_save_enabled_(false),
      auto_save_interval_(60.0f),
      last_auto_save_time_(0.0f),
      status_bar_message_("Ready"),
      show_find_dialog_(false),
      cursor_line_(1),
      cursor_column_(0) {
    
    // Initialize editor buffer with empty content (lazy initialization is better than memset)
    editor_buffer_[0] = '\0';
    ai_input_buffer_[0] = '\0';
    terminal_input_buffer_[0] = '\0';
    find_buffer_[0] = '\0';
    
    // Initialize baud rates
    baud_rates_ = {9600, 19200, 38400, 57600, 115200, 230400, 460800, 921600};
    
    // Initialize root folder structure
    root_folder_.name = "Project";
    root_folder_.path = "";
    root_folder_.is_folder = true;
    
    // Initialize RE analysis result
    re_analysis_result_.architecture = "";
    re_analysis_result_.flash_size = "";
    re_analysis_result_.entry_point = "";
    re_analysis_result_.functions_detected = 0;
    re_analysis_result_.strings_found = 0;
    re_analysis_result_.has_data = false;
    
    // Initialize terminal with welcome message
    terminal_history_.push_back("ESP32 Driver IDE Terminal v1.0");
    terminal_history_.push_back("Type 'help' for available commands");
    terminal_history_.push_back("");
}

ImGuiWindow::~ImGuiWindow() {
    Shutdown();
}

bool ImGuiWindow::Initialize(int width, int height) {
    // Setup GLFW
    glfwSetErrorCallback(glfw_error_callback);
    if (!glfwInit()) {
        std::cerr << "Failed to initialize GLFW" << std::endl;
        return false;
    }
    
    // GL 3.3 + GLSL 330
    const char* glsl_version = "#version 330";
    glfwWindowHint(GLFW_CONTEXT_VERSION_MAJOR, 3);
    glfwWindowHint(GLFW_CONTEXT_VERSION_MINOR, 3);
    glfwWindowHint(GLFW_OPENGL_PROFILE, GLFW_OPENGL_CORE_PROFILE);
#ifdef __APPLE__
    glfwWindowHint(GLFW_OPENGL_FORWARD_COMPAT, GL_TRUE);
#endif
    
    // Create window
    window_ = glfwCreateWindow(width, height, "ESP32 Driver IDE", nullptr, nullptr);
    if (window_ == nullptr) {
        std::cerr << "Failed to create GLFW window" << std::endl;
        std::cerr << "Check if display is available and OpenGL 3.3+ is supported" << std::endl;
        glfwTerminate();
        return false;
    }
    
    glfwMakeContextCurrent(window_);
    glfwSwapInterval(1); // Enable vsync
    
    // Setup Dear ImGui context
    IMGUI_CHECKVERSION();
    ImGui::CreateContext();
    if (ImGui::GetCurrentContext() == nullptr) {
        std::cerr << "Failed to create ImGui context" << std::endl;
        glfwDestroyWindow(window_);
        glfwTerminate();
        return false;
    }
    
    ImGuiIO& io = ImGui::GetIO();
    io.ConfigFlags |= ImGuiConfigFlags_NavEnableKeyboard;
    // Note: Docking feature requires ImGui docking branch
    // io.ConfigFlags |= ImGuiConfigFlags_DockingEnable;
    
    // Setup Platform/Renderer backends
    if (!ImGui_ImplGlfw_InitForOpenGL(window_, true)) {
        std::cerr << "Failed to initialize ImGui GLFW backend" << std::endl;
        ImGui::DestroyContext();
        glfwDestroyWindow(window_);
        glfwTerminate();
        return false;
    }
    
    if (!ImGui_ImplOpenGL3_Init(glsl_version)) {
        std::cerr << "Failed to initialize ImGui OpenGL3 backend" << std::endl;
        ImGui_ImplGlfw_Shutdown();
        ImGui::DestroyContext();
        glfwDestroyWindow(window_);
        glfwTerminate();
        return false;
    }
    
    // Setup style
    SetupImGuiStyle();
    
    // Initialize blueprint editor
    blueprint_editor_ = std::make_unique<BlueprintEditor>();
    if (!blueprint_editor_->Initialize()) {
        std::cerr << "Failed to initialize Blueprint Editor" << std::endl;
        // Continue anyway, non-fatal
    }
    
    AddConsoleMessage("ESP32 Driver IDE v1.0.0 initialized");
    AddConsoleMessage("ImGui interface ready");
    
