kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
    return true;
}

void ImGuiWindow::Run() {
    if (window_ == nullptr) {
        std::cerr << "Cannot run: window not initialized" << std::endl;
        return;
    }
    
    ImVec4 clear_color = ImVec4(0.1f, 0.1f, 0.1f, 1.0f);
    
    // Main loop
    while (!glfwWindowShouldClose(window_)) {
        glfwPollEvents();
        
        // Start the Dear ImGui frame
        ImGui_ImplOpenGL3_NewFrame();
        ImGui_ImplGlfw_NewFrame();
        ImGui::NewFrame();
        
        // Handle keyboard shortcuts
        HandleKeyboardShortcuts();
        
        // Perform auto-save if enabled
        if (auto_save_enabled_) {
            PerformAutoSave();
        }
        
        // Render UI
        RenderMainMenuBar();
        RenderToolbar();
        
        // Create main docking space
        ImGuiViewport* viewport = ImGui::GetMainViewport();
        if (viewport == nullptr) {
            // Properly end the frame before continuing
            ImGui::EndFrame();
            ImGui::Render();
            int display_w, display_h;
            glfwGetFramebufferSize(window_, &display_w, &display_h);
            glViewport(0, 0, display_w, display_h);
            glClearColor(clear_color.x, clear_color.y, clear_color.z, clear_color.w);
            glClear(GL_COLOR_BUFFER_BIT);
            ImGui_ImplOpenGL3_RenderDrawData(ImGui::GetDrawData());
            glfwSwapBuffers(window_);
            continue;
        }
        
        ImGui::SetNextWindowPos(ImVec2(viewport->Pos.x, viewport->Pos.y + 80)); // After menu and toolbar
        ImGui::SetNextWindowSize(ImVec2(viewport->Size.x, viewport->Size.y - 280)); // Leave space for console
        
        ImGuiWindowFlags window_flags = ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoCollapse |
                                       ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoMove |
                                       ImGuiWindowFlags_NoBringToFrontOnFocus | ImGuiWindowFlags_NoNavFocus;
        
        ImGui::Begin("MainDockSpace", nullptr, window_flags);
        
        // Four-column layout (added AI assistant)
        float window_width = ImGui::GetContentRegionAvail().x;
        float left_panel_width = (show_file_explorer_ || show_board_list_) ? LEFT_PANEL_WIDTH : 0.0f;
        float right_panel_width = show_properties_panel_ ? RIGHT_PANEL_WIDTH : 0.0f;
        float ai_panel_width = show_ai_assistant_ ? AI_PANEL_WIDTH : 0.0f;
        float center_panel_width = window_width - left_panel_width - right_panel_width - ai_panel_width;
        
        // Left panel - File Explorer and Board List
        if (show_file_explorer_ || show_board_list_) {
            ImGui::BeginChild("LeftPanel", ImVec2(left_panel_width, 0), true);
            
            if (ImGui::BeginTabBar("LeftPanelTabs")) {
                if (show_file_explorer_ && ImGui::BeginTabItem("Files")) {
                    RenderFileExplorer();
                    ImGui::EndTabItem();
                }
                
                if (show_board_list_ && ImGui::BeginTabItem("Boards")) {
                    RenderBoardListPanel();
                    ImGui::EndTabItem();
                }
                
                ImGui::EndTabBar();
            }
            
            ImGui::EndChild();
            ImGui::SameLine();
        }
        
        // Center panel - Editor/Debugger/RE tabs
        ImGui::BeginChild("CenterPanel", ImVec2(center_panel_width, 0), true);
        RenderCenterPanel();
        ImGui::EndChild();
        
        // Right panel - Properties
        if (show_properties_panel_) {
            ImGui::SameLine();
            ImGui::BeginChild("PropertiesPanel", ImVec2(right_panel_width, 0), true);
            RenderPropertiesPanel();
            ImGui::EndChild();
        }
        
        // AI Assistant panel
        if (show_ai_assistant_) {
            ImGui::SameLine();
            ImGui::BeginChild("AIAssistant", ImVec2(ai_panel_width, 0), true);
            RenderAIAssistant();
            ImGui::EndChild();
        }
        
        ImGui::End();
        
        // Bottom panels - Console and Terminal
        float bottom_panel_width = show_terminal_ ? viewport->Size.x / 2.0f : viewport->Size.x;
        
        // Console at the bottom left
        ImGui::SetNextWindowPos(ImVec2(viewport->Pos.x, viewport->Pos.y + viewport->Size.y - 200));
        ImGui::SetNextWindowSize(ImVec2(bottom_panel_width, 200));
        ImGui::Begin("Console", nullptr, ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoMove);
        RenderConsole();
        ImGui::End();
        
        // Terminal at the bottom right
        if (show_terminal_) {
            ImGui::SetNextWindowPos(ImVec2(viewport->Pos.x + bottom_panel_width, viewport->Pos.y + viewport->Size.y - 200));
            ImGui::SetNextWindowSize(ImVec2(viewport->Size.x - bottom_panel_width, 200));
            ImGui::Begin("Terminal", nullptr, ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoMove);
            RenderTerminalPanel();
            ImGui::End();
        }
        
        // Device Schematic Window (floating)
        if (show_device_schematic_) {
            ImGui::SetNextWindowSize(ImVec2(600, 700), ImGuiCond_FirstUseEver);
            ImGui::Begin("Device Schematic", &show_device_schematic_);
            RenderDeviceSchematic();
            ImGui::End();
        }
        
        // Find dialog (floating)
        if (show_find_dialog_) {
            RenderFindDialog();
        }
        
        // Status bar at the very bottom
        RenderStatusBar();
        
        // Rendering
        ImGui::Render();
        int display_w, display_h;
        glfwGetFramebufferSize(window_, &display_w, &display_h);
        glViewport(0, 0, display_w, display_h);
        glClearColor(clear_color.x, clear_color.y, clear_color.z, clear_color.w);
        glClear(GL_COLOR_BUFFER_BIT);
        ImGui_ImplOpenGL3_RenderDrawData(ImGui::GetDrawData());
        
        glfwSwapBuffers(window_);
    }
}

