kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
    // Connect/Disconnect button with status
    if (!is_connected_) {
        if (ImGui::Button("Connect")) {
            ConnectToDevice();
        }
        if (ImGui::IsItemHovered()) {
            ImGui::SetTooltip("Connect to selected ESP32 device");
        }
    } else {
        if (ImGui::Button("Disconnect")) {
            DisconnectFromDevice();
        }
        if (ImGui::IsItemHovered()) {
            ImGui::SetTooltip("Disconnect from ESP32 device");
        }
    }
    
    // Show connection status
    if (connection_attempted_) {
        ImGui::SameLine();
        if (is_connected_) {
            ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ Connected");
        } else {
            ImGui::TextColored(ImVec4(1.0f, 0.0f, 0.0f, 1.0f), "✗ Failed");
        }
    }
    
    ImGui::SameLine();
    ImGui::Separator();
    ImGui::SameLine();
    
    // Action buttons
    if (ImGui::Button("Upload")) {
        UploadCode();
    }
    if (ImGui::IsItemHovered()) {
        ImGui::SetTooltip("Upload code to ESP32 device (Ctrl+U)");
    }
    ImGui::SameLine();
    
    if (ImGui::Button("Download")) {
        DownloadFirmware();
    }
    if (ImGui::IsItemHovered()) {
        ImGui::SetTooltip("Download firmware from ESP32 device");
    }
    ImGui::SameLine();
    
    if (ImGui::Button("Debug")) {
        DebugCode();
    }
    if (ImGui::IsItemHovered()) {
        ImGui::SetTooltip("Start debugging session");
    }
    ImGui::SameLine();
    
    if (ImGui::Button("RE")) {
        ReverseEngineerCode();
        current_center_tab_ = 2; // Switch to RE tab
    }
    if (ImGui::IsItemHovered()) {
        ImGui::SetTooltip("Reverse engineer firmware");
    }
    
    ImGui::End();
}

void ImGuiWindow::RenderFileExplorer() {
    ImGui::Text("File Explorer");
    ImGui::Separator();
    
    if (ImGui::Button("New File")) {
        // Create new editor tab
        EditorTab new_tab;
        new_tab.filename = "sketch_" + std::to_string(editor_tabs_.size() + 1) + ".ino";
        new_tab.content = SIMPLE_SKETCH_TEMPLATE;
        new_tab.is_modified = false;
        std::snprintf(new_tab.buffer, EDITOR_BUFFER_SIZE, "%s", new_tab.content.c_str());
        editor_tabs_.push_back(new_tab);
        active_editor_tab_ = editor_tabs_.size() - 1;
        RefreshFileList();
    }
    
    ImGui::SameLine();
    if (ImGui::Button("New Folder")) {
        FileNode new_folder;
        new_folder.name = "NewFolder";
        new_folder.path = "/NewFolder";
        new_folder.is_folder = true;
        root_folder_.children.push_back(new_folder);
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Refresh")) {
        RefreshFileList();
    }
    
    ImGui::Separator();
    
    // Render hierarchical file tree
    RenderFileNode(root_folder_, "");
}

void ImGuiWindow::RenderCenterPanel() {
    if (ImGui::BeginTabBar("CenterTabs")) {
        if (ImGui::BeginTabItem("Editor")) {
            current_center_tab_ = 0;
            RenderEditorTab();
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Debugger")) {
            current_center_tab_ = 1;
            RenderDebuggerTab();
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Reverse Engineering")) {
            current_center_tab_ = 2;
            RenderReverseEngineeringTab();
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Blueprint")) {
            current_center_tab_ = 3;
            RenderBlueprintTab();
            ImGui::EndTabItem();
        }
        
        ImGui::EndTabBar();
    }
}

void ImGuiWindow::RenderEditorTab() {
    // Multi-tab editor
    if (editor_tabs_.empty()) {
        ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "No files open. Create a new file or open an existing one.");
        return;
    }
    
    if (ImGui::BeginTabBar("EditorTabs", ImGuiTabBarFlags_Reorderable | ImGuiTabBarFlags_AutoSelectNewTabs)) {
        for (size_t i = 0; i < editor_tabs_.size(); i++) {
            bool open = true;
            std::string tab_label = editor_tabs_[i].filename;
            if (editor_tabs_[i].is_modified) {
                tab_label += "*";
            }
            
            if (ImGui::BeginTabItem(tab_label.c_str(), &open)) {
                active_editor_tab_ = i;
                
                ImGui::Text("File: %s", editor_tabs_[i].filename.c_str());
                if (editor_tabs_[i].is_modified) {
                    ImGui::SameLine();
                    ImGui::TextColored(ImVec4(1.0f, 0.7f, 0.0f, 1.0f), "(modified)");
                }
                
                ImGui::SameLine();
                ImGui::Checkbox("Syntax Highlighting", &enable_syntax_highlighting_);
                
                ImGui::Separator();
                
                // If syntax highlighting is enabled, show split view
                if (syntax_highlighter_ && enable_syntax_highlighting_) {
                    float available_height = ImGui::GetContentRegionAvail().y;
                    float editor_height = available_height * 0.5f;
                    
                    // Editable text area with line numbers
                    ImGui::Text("Edit Mode:");
                    
                    // Line numbers column
                    if (show_line_numbers_) {
                        ImGui::BeginChild("LineNumbers", ImVec2(50, editor_height), true);
                        int line_count = CountLines(editor_tabs_[i].content);
                        for (int line = 1; line <= line_count; ++line) {
                            ImGui::TextColored(ImVec4(0.5f, 0.5f, 0.5f, 1.0f), "%4d", line);
                        }
                        ImGui::EndChild();
                        ImGui::SameLine();
                    }
                    
                    float editor_width = show_line_numbers_ ? -1 : -1;
                    ImGuiInputTextFlags flags = ImGuiInputTextFlags_AllowTabInput;
                    if (ImGui::InputTextMultiline("##editor", editor_tabs_[i].buffer, EDITOR_BUFFER_SIZE,
                                                  ImVec2(editor_width, editor_height), flags)) {
                        editor_tabs_[i].content = std::string(editor_tabs_[i].buffer);
                        editor_tabs_[i].is_modified = true;
                        line_count_dirty_ = true;
                        if (text_editor_) {
                            text_editor_->SetText(editor_tabs_[i].content);
                        }
                    }
                    
                    ImGui::Separator();
                    ImGui::Text("Preview with Syntax Highlighting:");
                    
                    // Syntax highlighted preview
                    ImGui::BeginChild("SyntaxPreview", ImVec2(-1, -1), true, ImGuiWindowFlags_HorizontalScrollbar);
                    RenderSyntaxHighlightedText(editor_tabs_[i].content);
                    ImGui::EndChild();
                } else {
                    // Plain text editor (original behavior) with line numbers
                    if (show_line_numbers_) {
                        float available_height = ImGui::GetContentRegionAvail().y;
                        ImGui::BeginChild("LineNumbersPlain", ImVec2(50, available_height), true);
                        int line_count = CountLines(editor_tabs_[i].content);
                        for (int line = 1; line <= line_count; ++line) {
                            ImGui::TextColored(ImVec4(0.5f, 0.5f, 0.5f, 1.0f), "%4d", line);
                        }
                        ImGui::EndChild();
                        ImGui::SameLine();
                    }
                    
                    ImGuiInputTextFlags flags = ImGuiInputTextFlags_AllowTabInput;
                    if (ImGui::InputTextMultiline("##editor", editor_tabs_[i].buffer, EDITOR_BUFFER_SIZE,
                                                  ImVec2(-1, -1), flags)) {
                        editor_tabs_[i].content = std::string(editor_tabs_[i].buffer);
                        editor_tabs_[i].is_modified = true;
                        line_count_dirty_ = true;
                        if (text_editor_) {
                            text_editor_->SetText(editor_tabs_[i].content);
                        }
                    }
                }
                
