kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
                ImGui::EndTabItem();
            }
            
            if (!open) {
                CloseTab(i);
            }
        }
        
        ImGui::EndTabBar();
    }
}

void ImGuiWindow::RenderDebuggerTab() {
    ImGui::Text("ESP32 Debugger");
    ImGui::Separator();
    
    // Check connection status
    if (!is_connected_) {
        ImGui::TextColored(ImVec4(1.0f, 0.5f, 0.0f, 1.0f), "⚠ No device connected");
        ImGui::TextWrapped("Please connect to a device using the toolbar before debugging.");
        ImGui::Spacing();
        if (ImGui::Button("Go to Toolbar")) {
            AddConsoleMessage("Use the Connect button in the toolbar to connect to your ESP32 device");
        }
        return;
    }
    
    ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ Device connected: %s", selected_port_.c_str());
    ImGui::Spacing();
    
    // Debugging controls
    bool is_reading = serial_monitor_ && serial_monitor_->IsRealtimeReading();
    
    if (!is_reading) {
        if (ImGui::Button("Start Debugging")) {
            DebugCode();
            if (serial_monitor_) {
                serial_monitor_->StartRealtimeReading();
            }
        }
    } else {
        if (ImGui::Button("Stop Debugging")) {
            if (serial_monitor_) {
                serial_monitor_->StopRealtimeReading();
            }
            AddConsoleMessage("Debugging stopped");
        }
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Clear Data")) {
        if (serial_monitor_) {
            serial_monitor_->ClearRealtimeData();
        }
        AddConsoleMessage("Cleared realtime data");
    }
    
    ImGui::Separator();
    ImGui::Text("Realtime Device Data:");
    
    // Show realtime data from device
    ImGui::BeginChild("RealtimeData", ImVec2(0, 200), true);
    if (serial_monitor_ && is_reading) {
        auto data = serial_monitor_->GetRealtimeData();
        for (const auto& line : data) {
            // Color code different types of messages
            if (line.find("ERROR") != std::string::npos || line.find("Failed") != std::string::npos) {
                ImGui::TextColored(ImVec4(1.0f, 0.3f, 0.3f, 1.0f), "%s", line.c_str());
            } else if (line.find("WARNING") != std::string::npos) {
                ImGui::TextColored(ImVec4(1.0f, 0.8f, 0.0f, 1.0f), "%s", line.c_str());
            } else if (line.find("Connected") != std::string::npos || line.find("SUCCESS") != std::string::npos) {
                ImGui::TextColored(ImVec4(0.3f, 1.0f, 0.3f, 1.0f), "%s", line.c_str());
            } else {
                ImGui::Text("%s", line.c_str());
            }
        }
    } else {
        ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "Click 'Start Debugging' to begin reading data from device");
    }
    ImGui::EndChild();
    
    ImGui::Separator();
    ImGui::Text("Breakpoints:");
    ImGui::BeginChild("Breakpoints", ImVec2(0, 80), true);
    ImGui::BulletText("No breakpoints set");
    ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "Click line numbers in editor to set breakpoints (future feature)");
    ImGui::EndChild();
    
    ImGui::Separator();
    ImGui::Text("Variables & Registers:");
    ImGui::BeginChild("Variables", ImVec2(0, 0), true);
    if (is_reading) {
        ImGui::Columns(2);
        ImGui::Text("Variable"); ImGui::NextColumn();
        ImGui::Text("Value"); ImGui::NextColumn();
        ImGui::Separator();
        
        // Simulate variable inspection
        ImGui::Text("Free Heap"); ImGui::NextColumn();
        ImGui::Text("280000 bytes"); ImGui::NextColumn();
        
        ImGui::Text("WiFi Status"); ImGui::NextColumn();
        ImGui::Text("Connected"); ImGui::NextColumn();
        
        ImGui::Text("GPIO2"); ImGui::NextColumn();
        ImGui::Text("HIGH"); ImGui::NextColumn();
        
        ImGui::Text("CPU Freq"); ImGui::NextColumn();
        ImGui::Text("240 MHz"); ImGui::NextColumn();
        
        ImGui::Columns(1);
    } else {
        ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "Start debugging to see variables");
    }
    ImGui::EndChild();
}

void ImGuiWindow::RenderReverseEngineeringTab() {
    ImGui::Text("Reverse Engineering Tools");
    ImGui::Separator();
    
    // Display available devices list - helps users see all detected devices at a glance
    ImGui::TextColored(ImVec4(0.3f, 0.8f, 1.0f, 1.0f), "Available Devices:");
    ImGui::Spacing();
    
    if (available_ports_.empty()) {
        ImGui::TextColored(ImVec4(1.0f, 0.5f, 0.0f, 1.0f), "⚠ No devices found");
        ImGui::TextWrapped("Click 'Refresh Ports' in the toolbar to scan for devices.");
    } else {
        ImGui::BeginChild("DeviceList", ImVec2(0, 100), true);
        for (size_t i = 0; i < available_ports_.size(); i++) {
            bool is_current = (available_ports_[i] == selected_port_);
            bool is_connected = is_current && is_connected_;
            
            if (is_connected) {
                ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ %s (Connected)", available_ports_[i].c_str());
            } else if (is_current) {
                ImGui::TextColored(ImVec4(1.0f, 1.0f, 0.0f, 1.0f), "○ %s (Selected)", available_ports_[i].c_str());
            } else {
                ImGui::Text("  %s", available_ports_[i].c_str());
            }
        }
        ImGui::EndChild();
        
        ImGui::TextWrapped("Found %u device(s). Select and connect to a device from the toolbar.", 
                           static_cast<unsigned int>(available_ports_.size()));
    }
    
    ImGui::Separator();
    ImGui::Spacing();
    
    // Check connection status
    if (!is_connected_) {
        ImGui::TextColored(ImVec4(1.0f, 0.5f, 0.0f, 1.0f), "⚠ No device connected");
        ImGui::TextWrapped("Please connect to a device using the toolbar before reverse engineering.");
        ImGui::Spacing();
        if (ImGui::Button("Go to Toolbar")) {
            AddConsoleMessage("Use the Connect button in the toolbar to connect to your ESP32 device");
        }
        return;
    }
    
    ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ Device connected: %s", selected_port_.c_str());
    ImGui::Spacing();
    
    if (ImGui::Button("Analyze Binary")) {
        ReverseEngineerCode();
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Disassemble")) {
        AddConsoleMessage("=== Disassembling Firmware ===");
        AddConsoleMessage("Reading flash memory from device...");
        AddConsoleMessage("Parsing instruction set...");
        AddConsoleMessage("Identifying function boundaries...");
        
        // Populate disassembly data with sample ESP32 Xtensa instructions
        // In a real implementation, this would read from the actual device flash
        re_disassembly_data_ = SAMPLE_DISASSEMBLY_DATA;
        
