kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
        re_disassembly_performed_ = true;
        AddConsoleMessage("✓ Disassembly complete - " + std::to_string(re_disassembly_data_.size()) + " instructions decoded");
    }
    
    ImGui::Separator();
    ImGui::Text("Analysis Results:");
    
    ImGui::BeginChild("REResults", ImVec2(0, 0), true);
    
    // Display analysis results if available, otherwise show prompt
    if (re_analysis_performed_ && re_analysis_result_.has_data) {
        ImGui::TextWrapped("ESP32 Firmware Analysis:");
        ImGui::BulletText("Architecture: %s", re_analysis_result_.architecture.c_str());
        ImGui::BulletText("Flash size: %s", re_analysis_result_.flash_size.c_str());
        ImGui::BulletText("Entry point: %s", re_analysis_result_.entry_point.c_str());
        ImGui::BulletText("Functions detected: %d", re_analysis_result_.functions_detected);
        ImGui::BulletText("Strings found: %d", re_analysis_result_.strings_found);
        
        // Show disassembly if it has been performed
        if (re_disassembly_performed_ && !re_disassembly_data_.empty()) {
            ImGui::Spacing();
            ImGui::Separator();
            ImGui::Spacing();
            ImGui::TextWrapped("Disassembly Output:");
            for (const auto& line : re_disassembly_data_) {
                ImGui::TextUnformatted(line.c_str());
            }
        }
    } else {
        ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "No analysis data available yet.");
        ImGui::TextWrapped("Click 'Analyze Binary' to perform firmware analysis or 'Disassemble' to view disassembled code.");
    }
    
    ImGui::EndChild();
}

void ImGuiWindow::RenderPropertiesPanel() {
    if (ImGui::BeginTabBar("PropertiesTabs")) {
        if (ImGui::BeginTabItem("Editor")) {
            ImGui::Text("File Info:");
            if (!editor_tabs_.empty() && active_editor_tab_ < editor_tabs_.size()) {
                const auto& tab = editor_tabs_[active_editor_tab_];
                ImGui::BulletText("Name: %s", tab.filename.c_str());
                ImGui::BulletText("Size: %zu bytes", tab.content.size());
                
                // Calculate line count only when content changes
                if (line_count_dirty_) {
                    cached_line_count_ = static_cast<int>(std::count(tab.content.begin(), tab.content.end(), '\n') + 1);
                    line_count_dirty_ = false;
                }
                ImGui::BulletText("Lines: %d", cached_line_count_);
                ImGui::BulletText("Modified: %s", tab.is_modified ? "Yes" : "No");
            } else {
                ImGui::TextDisabled("No file loaded");
            }
            
            ImGui::Separator();
            ImGui::Text("Editor Settings:");
            
            static bool show_line_numbers = true;
            static bool auto_indent = true;
            
            ImGui::Checkbox("Show line numbers", &show_line_numbers);
            ImGui::Checkbox("Auto indent", &auto_indent);
            ImGui::Checkbox("Syntax highlighting", &enable_syntax_highlighting_);
            
            ImGui::Separator();
            ImGui::Text("Board Config:");
            
            static int board_type = 0;
            const char* board_types[] = { "ESP32", "ESP32-S2", "ESP32-S3", "ESP32-C3" };
            ImGui::Combo("Board", &board_type, board_types, IM_ARRAYSIZE(board_types));
            
            static int freq = 240;
            ImGui::SliderInt("CPU Freq (MHz)", &freq, 80, 240);
            
            if (ImGui::Button("Apply Settings")) {
                AddConsoleMessage("Settings applied");
            }
            
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Templates")) {
            ImGui::Text("Code Templates");
            ImGui::Separator();
            
            if (file_manager_) {
                auto templates = file_manager_->GetTemplates();
                
                if (templates.empty()) {
                    ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "No templates available");
                } else {
                    ImGui::Text("Available templates: %zu", templates.size());
                    ImGui::Spacing();
                    
                    ImGui::BeginChild("TemplateList", ImVec2(0, -30), true);
                    for (const auto& tmpl : templates) {
                        ImGui::PushID(tmpl.name.c_str());
                        
                        ImGui::TextColored(ImVec4(0.3f, 0.8f, 1.0f, 1.0f), "%s", tmpl.name.c_str());
                        ImGui::TextWrapped("%s", tmpl.description.c_str());
                        
                        if (ImGui::Button("Insert")) {
                            auto code = file_manager_->ApplyTemplate(tmpl.name, {});
                            if (!code.empty()) {
                                InsertCodeIntoEditor(code);
                            }
                        }
                        
                        ImGui::Separator();
                        ImGui::PopID();
                    }
                    ImGui::EndChild();
                }
            } else {
                ImGui::TextDisabled("File manager not available");
            }
            
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Completion")) {
            ImGui::Text("Code Completion");
            ImGui::Separator();
            
            ImGui::TextWrapped("Available code completion features:");
            ImGui::Spacing();
            
            if (ImGui::CollapsingHeader("GPIO Functions")) {
                if (ImGui::Button("pinMode()")) {
                    InsertCodeIntoEditor("pinMode(pin, mode);");
                }
                if (ImGui::Button("digitalWrite()")) {
                    InsertCodeIntoEditor("digitalWrite(pin, value);");
                }
                if (ImGui::Button("digitalRead()")) {
                    InsertCodeIntoEditor("digitalRead(pin);");
                }
                if (ImGui::Button("analogRead()")) {
                    InsertCodeIntoEditor("analogRead(pin);");
                }
            }
            
            if (ImGui::CollapsingHeader("Serial Functions")) {
                if (ImGui::Button("Serial.begin()")) {
                    InsertCodeIntoEditor("Serial.begin(115200);");
                }
                if (ImGui::Button("Serial.println()")) {
                    InsertCodeIntoEditor("Serial.println(\"message\");");
                }
                if (ImGui::Button("Serial.print()")) {
                    InsertCodeIntoEditor("Serial.print(\"message\");");
                }
            }
            
            if (ImGui::CollapsingHeader("WiFi Functions")) {
                if (ImGui::Button("WiFi.begin()")) {
                    InsertCodeIntoEditor("WiFi.begin(ssid, password);");
                }
                if (ImGui::Button("WiFi.status()")) {
                    InsertCodeIntoEditor("WiFi.status();");
                }
                if (ImGui::Button("WiFi.localIP()")) {
                    InsertCodeIntoEditor("WiFi.localIP();");
                }
            }
            
            if (ImGui::CollapsingHeader("Timing Functions")) {
                if (ImGui::Button("delay()")) {
                    InsertCodeIntoEditor("delay(1000);");
                }
                if (ImGui::Button("millis()")) {
                    InsertCodeIntoEditor("millis();");
                }
                if (ImGui::Button("micros()")) {
                    InsertCodeIntoEditor("micros();");
                }
            }
            
