kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
    AddConsoleMessage("✓ Analysis complete - see RE tab for details");
}

void ImGuiWindow::ConnectToDevice() {
    if (selected_port_.empty()) {
        AddConsoleMessage("⚠ No port selected. Please select a port first.");
        connection_attempted_ = true;
        is_connected_ = false;
        return;
    }
    
    AddConsoleMessage("=== Attempting Connection ===");
    AddConsoleMessage("Port: " + selected_port_);
    AddConsoleMessage("Baud rate: " + std::to_string(selected_baud_rate_));
    
    if (serial_monitor_) {
        bool success = serial_monitor_->Connect(selected_port_, selected_baud_rate_);
        is_connected_ = success;
        connection_attempted_ = true;
        
        if (success) {
            AddConsoleMessage("✓ Successfully connected to " + selected_port_);
        } else {
            AddConsoleMessage("✗ Failed to connect to " + selected_port_);
        }
    } else {
        is_connected_ = false;
        connection_attempted_ = true;
        AddConsoleMessage("✗ Serial monitor not initialized");
    }
}

void ImGuiWindow::DisconnectFromDevice() {
    if (!is_connected_) {
        AddConsoleMessage("⚠ No device connected");
        return;
    }
    
    AddConsoleMessage("=== Disconnecting ===");
    
    if (serial_monitor_) {
        serial_monitor_->Disconnect();
        is_connected_ = false;
        AddConsoleMessage("✓ Disconnected from " + selected_port_);
    }
}

void ImGuiWindow::DownloadFirmware() {
    if (!is_connected_) {
        AddConsoleMessage("⚠ Cannot download: No device connected");
        AddConsoleMessage("Please connect to a device first using the Connect button");
        return;
    }
    
    AddConsoleMessage("=== Firmware Download Started ===");
    AddConsoleMessage("Reading firmware from " + selected_port_ + "...");
    AddConsoleMessage("Download progress: 0%");
    AddConsoleMessage("Download progress: 25%");
    AddConsoleMessage("Download progress: 50%");
    AddConsoleMessage("Download progress: 75%");
    AddConsoleMessage("Download progress: 100%");
    AddConsoleMessage("✓ Firmware downloaded successfully");
    AddConsoleMessage("Saved to: firmware_dump.bin");
    AddConsoleMessage("=== Download Finished ===");
}

void ImGuiWindow::SaveCurrentTab() {
    if (!IsValidTabIndex(active_editor_tab_)) {
        AddConsoleMessage("Error: No file to save");
        return;
    }
    
    auto& tab = editor_tabs_[active_editor_tab_];
    
    if (file_manager_) {
        file_manager_->SetFileContent(tab.filename, tab.content);
        file_manager_->SaveFile(tab.filename);
        tab.is_modified = false;
        AddConsoleMessage("Saved file: " + tab.filename);
    } else {
        AddConsoleMessage("⚠ File manager not initialized");
    }
}

void ImGuiWindow::CloseTab(int tab_index) {
    if (tab_index < 0 || tab_index >= static_cast<int>(editor_tabs_.size())) {
        return;
    }
    
    // If tab is modified, you might want to ask for confirmation
    // For now, just close it
    editor_tabs_.erase(editor_tabs_.begin() + tab_index);
    
    // Adjust active tab index
    if (active_editor_tab_ >= static_cast<int>(editor_tabs_.size()) && !editor_tabs_.empty()) {
        active_editor_tab_ = editor_tabs_.size() - 1;
    }
}

void ImGuiWindow::RenderFileNode(FileNode& node, const std::string& parent_path) {
    std::string full_path = parent_path + "/" + node.name;
    
    if (node.is_folder) {
        bool node_open = ImGui::TreeNode(("📁 " + node.name).c_str());
        if (node_open) {
            for (auto& child : node.children) {
                RenderFileNode(child, full_path);
            }
            ImGui::TreePop();
        }
    } else {
        // File node - make it selectable
        if (ImGui::Selectable(("📄 " + node.name).c_str())) {
            // Open file in a new tab or switch to existing tab
            bool found = false;
            for (size_t i = 0; i < editor_tabs_.size(); i++) {
                if (editor_tabs_[i].filename == node.name) {
                    active_editor_tab_ = i;
                    found = true;
                    break;
                }
            }
            
            if (!found) {
                // Create new tab
                EditorTab new_tab;
                new_tab.filename = node.name;
                
                if (file_manager_ && file_manager_->FileExists(node.name)) {
                    new_tab.content = file_manager_->GetFileContent(node.name);
                } else {
                    new_tab.content = "// File: " + node.name + "\n\n" + std::string(SIMPLE_SKETCH_TEMPLATE);
                }
                
                new_tab.is_modified = false;
                std::snprintf(new_tab.buffer, EDITOR_BUFFER_SIZE, "%s", new_tab.content.c_str());
                editor_tabs_.push_back(new_tab);
                active_editor_tab_ = editor_tabs_.size() - 1;
                
                AddConsoleMessage("Opened file: " + node.name);
            }
        }
    }
}

void ImGuiWindow::RenderAIAssistant() {
    ImGui::Text("AI Assistant");
    ImGui::Separator();
    
    // Chat history
    ImGui::BeginChild("AIChatHistory", ImVec2(0, -60), true);
    
    if (ai_chat_history_.empty()) {
        ImGui::TextWrapped("Welcome! I'm your ESP32 & Arduino programming assistant. Ask me anything about:");
        ImGui::BulletText("GPIO pin configuration");
        ImGui::BulletText("WiFi and Bluetooth setup");
        ImGui::BulletText("Sensor integration");
        ImGui::BulletText("Code debugging");
        ImGui::BulletText("Best practices");
        ImGui::Spacing();
        ImGui::TextColored(ImVec4(0.4f, 1.0f, 0.4f, 1.0f), "💡 Try: 'Generate code for LED blink'");
    } else {
        for (size_t i = 0; i < ai_chat_history_.size(); i++) {
            const auto& exchange = ai_chat_history_[i];
            
            // User message
            ImGui::PushStyleColor(ImGuiCol_Text, ImVec4(0.4f, 0.8f, 1.0f, 1.0f));
            ImGui::TextWrapped("You: %s", exchange.first.c_str());
            ImGui::PopStyleColor();
            ImGui::Spacing();
            
            // Assistant message
            ImGui::PushStyleColor(ImGuiCol_Text, ImVec4(0.4f, 1.0f, 0.4f, 1.0f));
            ImGui::TextWrapped("AI: %s", exchange.second.c_str());
            ImGui::PopStyleColor();
            
