kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
    if (terminal_scroll_to_bottom_) {
        ImGui::SetScrollHereY(1.0f);
        terminal_scroll_to_bottom_ = false;
    }
    ImGui::EndChild();
    
    // Command input
    ImGui::PushItemWidth(-1);
    if (ImGui::InputText("##terminal_input", terminal_input_buffer_, sizeof(terminal_input_buffer_), 
                         ImGuiInputTextFlags_EnterReturnsTrue)) {
        std::string command(terminal_input_buffer_);
        if (!command.empty()) {
            ExecuteTerminalCommand(command);
            terminal_input_buffer_[0] = '\0';
            terminal_scroll_to_bottom_ = true;
        }
    }
    ImGui::PopItemWidth();
}

void ImGuiWindow::ExecuteTerminalCommand(const std::string& command) {
    terminal_history_.push_back("$ " + command);
    
    if (command == "help") {
        terminal_history_.push_back("Available commands:");
        terminal_history_.push_back("  help     - Show this help message");
        terminal_history_.push_back("  clear    - Clear terminal output");
        terminal_history_.push_back("  compile  - Compile current code");
        terminal_history_.push_back("  upload   - Upload code to device");
        terminal_history_.push_back("  ports    - List available serial ports");
        terminal_history_.push_back("  boards   - List detected boards");
        terminal_history_.push_back("  ls       - List files in project");
    } else if (command == "clear") {
        terminal_history_.clear();
        terminal_history_.push_back("Terminal cleared");
    } else if (command == "compile") {
        terminal_history_.push_back("Compiling code...");
        CompileCode();
        terminal_history_.push_back("Compilation complete - check console for details");
    } else if (command == "upload") {
        terminal_history_.push_back("Uploading code to device...");
        UploadCode();
        terminal_history_.push_back("Upload complete - check console for details");
    } else if (command == "ports") {
        terminal_history_.push_back("Available serial ports:");
        if (available_ports_.empty()) {
            terminal_history_.push_back("  (none found)");
        } else {
            for (const auto& port : available_ports_) {
                terminal_history_.push_back("  " + port);
            }
        }
    } else if (command == "boards") {
        terminal_history_.push_back("Detected boards:");
        if (detected_boards_.empty()) {
            terminal_history_.push_back("  (none found - run 'ports' to scan)");
        } else {
            for (const auto& board : detected_boards_) {
                terminal_history_.push_back("  " + board.name + " - " + board.chip + " @ " + board.port);
            }
        }
    } else if (command == "ls") {
        terminal_history_.push_back("Project files:");
        for (const auto& file : file_list_) {
            terminal_history_.push_back("  " + file);
        }
    } else {
        terminal_history_.push_back("Error: Unknown command '" + command + "'");
        terminal_history_.push_back("Type 'help' for available commands");
    }
}

void ImGuiWindow::RenderBoardListPanel() {
    ImGui::Text("Detected Boards");
    ImGui::Separator();
    
    if (ImGui::Button("Scan for Boards")) {
        RefreshBoardList();
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Show Schematic")) {
        show_device_schematic_ = !show_device_schematic_;
    }
    
    ImGui::Separator();
    
    if (detected_boards_.empty()) {
        ImGui::TextColored(ImVec4(1.0f, 0.5f, 0.0f, 1.0f), "No boards detected");
        ImGui::TextWrapped("Click 'Scan for Boards' to detect connected ESP32 devices");
    } else {
        ImGui::Text("Found %d board(s):", static_cast<int>(detected_boards_.size()));
        ImGui::Spacing();
        
        for (size_t i = 0; i < detected_boards_.size(); i++) {
            const auto& board = detected_boards_[i];
            
            ImGui::PushID(i);
            bool is_selected = (static_cast<int>(i) == selected_board_index_);
            
            if (ImGui::Selectable(board.name.c_str(), is_selected)) {
                selected_board_index_ = static_cast<int>(i);
            }
            
            if (is_selected) {
                ImGui::Indent();
                ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "Chip: %s", board.chip.c_str());
                ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "Port: %s", board.port.c_str());
                ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "Flash: %d MB", board.flash_size_mb);
                ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "RAM: %d KB", board.ram_size_kb);
                
                if (board.is_connected) {
                    ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ Connected");
                } else {
                    ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "Not connected");
                }
                ImGui::Unindent();
            }
            
            ImGui::PopID();
        }
    }
}

void ImGuiWindow::RefreshBoardList() {
    AddConsoleMessage("Scanning for ESP32 boards...");
    
    // Clear existing boards
    detected_boards_.clear();
    
    // Scan ports and try to detect board information
    RefreshPortList();
    
    for (const auto& port : available_ports_) {
        BoardInfo board;
        board.port = port;
        board.is_connected = (port == selected_port_ && is_connected_);
        
        // NOTE: This is a simplified board detection based on port name patterns.
        // In a production implementation, this should:
        // 1. Query the device via serial for chip ID (using esptool.py protocol)
        // 2. Read manufacturer/product strings from USB descriptors
        // 3. Use vendor ID (VID) and product ID (PID) to identify ESP32 devices
        // Current heuristic-based approach may incorrectly identify non-ESP32 devices.
        
        // ESP32 boards typically use CP2102, CH340, or FTDI USB-to-serial chips
        if (port.find("ttyUSB") != std::string::npos || port.find("USB") != std::string::npos) {
            board.name = "ESP32-DevKit";
            board.chip = "ESP32";
            board.flash_size_mb = 4;
            board.ram_size_kb = 520;
        } else if (port.find("ttyACM") != std::string::npos || port.find("ACM") != std::string::npos) {
            board.name = "ESP32-S3-DevKit";
            board.chip = "ESP32-S3";
            board.flash_size_mb = 8;
            board.ram_size_kb = 512;
        } else {
            // Default fallback for unrecognized ports
            board.name = "ESP32 Board";
            board.chip = "ESP32";
            board.flash_size_mb = 4;
            board.ram_size_kb = 520;
        }
        
