kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
        ImGui::TextColored(color, "%s", token.text.c_str());
        
        // Handle line breaks properly - if token contains newline, don't use SameLine
        if (token.text.find('\n') == std::string::npos) {
            ImGui::SameLine(0, 0);
        }
        // If token ends with newline, the next token will naturally start on new line
    }
}

void ImGuiWindow::RenderBlueprintTab() {
    ImGui::Text("Blueprint Node Editor");
    ImGui::Separator();
    
    // Toolbar for blueprint actions
    if (ImGui::Button("Clear All")) {
        if (blueprint_editor_) {
            blueprint_editor_->Clear();
        }
    }
    ImGui::SameLine();
    if (ImGui::Button("Generate Code")) {
        if (blueprint_editor_) {
            std::string generated_code = blueprint_editor_->GenerateCode();
            AddConsoleMessage("Generated code from blueprint:");
            AddConsoleMessage(generated_code);
        }
    }
    ImGui::SameLine();
    ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), 
                      "Right-click in empty space to add nodes");
    
    ImGui::Separator();
    
    // Render the blueprint editor
    if (blueprint_editor_) {
        blueprint_editor_->Render();
    } else {
        ImGui::TextColored(ImVec4(1.0f, 0.3f, 0.3f, 1.0f), 
                          "Blueprint editor failed to initialize");
    }
}

void ImGuiWindow::RenderStatusBar() {
    ImGuiViewport* viewport = ImGui::GetMainViewport();
    if (!viewport) return;
    
    ImGui::SetNextWindowPos(ImVec2(viewport->Pos.x, viewport->Pos.y + viewport->Size.y - 22));
    ImGui::SetNextWindowSize(ImVec2(viewport->Size.x, 22));
    
    ImGuiWindowFlags window_flags = ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | 
                                   ImGuiWindowFlags_NoMove | ImGuiWindowFlags_NoScrollbar | 
                                   ImGuiWindowFlags_NoSavedSettings;
    
    ImGui::PushStyleVar(ImGuiStyleVar_WindowPadding, ImVec2(5, 3));
    ImGui::Begin("StatusBar", nullptr, window_flags);
    
    // Left side - status message
    ImGui::Text("%s", status_bar_message_.c_str());
    
    ImGui::SameLine(viewport->Size.x - 400);
    ImGui::Separator();
    ImGui::SameLine();
    
    // Right side - file info
    if (active_editor_tab_ >= 0 && active_editor_tab_ < editor_tabs_.size()) {
        const auto& tab = editor_tabs_[active_editor_tab_];
        
        // File encoding
        ImGui::Text("UTF-8");
        ImGui::SameLine();
        ImGui::Separator();
        ImGui::SameLine();
        
        // Line/column
        ImGui::Text("Ln %d, Col %d", cursor_line_, cursor_column_);
        ImGui::SameLine();
        ImGui::Separator();
        ImGui::SameLine();
        
        // Line count
        int line_count = CountLines(tab.content);
        ImGui::Text("Lines: %d", line_count);
        
        if (tab.is_modified) {
            ImGui::SameLine();
            ImGui::Separator();
            ImGui::SameLine();
            ImGui::TextColored(ImVec4(1.0f, 0.7f, 0.0f, 1.0f), "Modified");
        }
    }
    
    ImGui::End();
    ImGui::PopStyleVar();
}

void ImGuiWindow::RenderFindDialog() {
    ImGui::SetNextWindowSize(ImVec2(400, 100), ImGuiCond_FirstUseEver);
    ImGui::Begin("Find", &show_find_dialog_);
    
    ImGui::Text("Find:");
    ImGui::SetNextItemWidth(-1);
    if (ImGui::InputText("##find", find_buffer_, sizeof(find_buffer_), ImGuiInputTextFlags_EnterReturnsTrue)) {
        FindInCurrentFile(find_buffer_);
    }
    
    ImGui::Spacing();
    if (ImGui::Button("Find Next", ImVec2(120, 0))) {
        FindInCurrentFile(find_buffer_);
    }
    ImGui::SameLine();
    if (ImGui::Button("Close", ImVec2(120, 0))) {
        show_find_dialog_ = false;
    }
    
    ImGui::End();
}

void ImGuiWindow::HandleKeyboardShortcuts() {
    ImGuiIO& io = ImGui::GetIO();
    
    // Ctrl+S - Save current file
    if (io.KeyCtrl && ImGui::IsKeyPressed(ImGui::GetKeyIndex(ImGuiKey_S), false)) {
        SaveCurrentTab();
        status_bar_message_ = "File saved";
    }
    
    // Ctrl+N - New file
    if (io.KeyCtrl && ImGui::IsKeyPressed(ImGui::GetKeyIndex(ImGuiKey_N), false)) {
        EditorTab new_tab;
        new_tab.filename = "sketch_" + std::to_string(editor_tabs_.size() + 1) + ".ino";
        new_tab.content = SIMPLE_SKETCH_TEMPLATE;
        new_tab.is_modified = false;
        std::snprintf(new_tab.buffer, EDITOR_BUFFER_SIZE, "%s", new_tab.content.c_str());
        editor_tabs_.push_back(new_tab);
        active_editor_tab_ = editor_tabs_.size() - 1;
        status_bar_message_ = "New file created";
    }
    
    // Ctrl+F - Find
    if (io.KeyCtrl && ImGui::IsKeyPressed(ImGui::GetKeyIndex(ImGuiKey_F), false)) {
        show_find_dialog_ = !show_find_dialog_;
    }
    
    // Ctrl+W - Close current tab
    if (io.KeyCtrl && ImGui::IsKeyPressed(ImGui::GetKeyIndex(ImGuiKey_W), false)) {
        if (active_editor_tab_ >= 0 && active_editor_tab_ < editor_tabs_.size()) {
            CloseTab(active_editor_tab_);
            status_bar_message_ = "Tab closed";
        }
    }
    
    // F5 - Compile
    if (ImGui::IsKeyPressed(ImGui::GetKeyIndex(ImGuiKey_F5), false)) {
        CompileCode();
    }
}

void ImGuiWindow::UpdateCursorPosition() {
    // This would be called when cursor moves in the editor
    // For now, we'll estimate based on buffer content
    // In a real implementation, this would track the actual cursor position
}

void ImGuiWindow::PerformAutoSave() {
    float current_time = (float)glfwGetTime();
    
    if (current_time - last_auto_save_time_ >= auto_save_interval_) {
        // Auto-save all modified tabs
        bool saved_any = false;
        for (auto& tab : editor_tabs_) {
            if (tab.is_modified) {
                // In a real implementation, this would save to file
                saved_any = true;
            }
        }
        
        if (saved_any) {
            status_bar_message_ = "Auto-saved at " + std::to_string((int)current_time) + "s";
        }
        
        last_auto_save_time_ = current_time;
    }
}

int ImGuiWindow::CountLines(const std::string& text) const {
    if (text.empty()) return 1;
    return std::count(text.begin(), text.end(), '\n') + 1;
}

void ImGuiWindow::FindInCurrentFile(const std::string& search_term) {
    if (search_term.empty()) return;
    if (active_editor_tab_ < 0 || active_editor_tab_ >= editor_tabs_.size()) return;
    
    const auto& content = editor_tabs_[active_editor_tab_].content;
    size_t pos = content.find(search_term);
    
    if (pos != std::string::npos) {
        status_bar_message_ = "Found at position " + std::to_string(pos);
        AddConsoleMessage("Found: '" + search_term + "' at position " + std::to_string(pos));
    } else {
        status_bar_message_ = "'" + search_term + "' not found";
        AddConsoleMessage("Not found: '" + search_term + "'");
    }
}

} // namespace gui
} // namespace esp32_ide
